@adeatcu-ionos here is the output of a plan that then caused the error when running with apply.
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.ionos_k8s_cluster[0].ionoscloud_k8s_node_pool.nodepool_legacy["ZONE_1-legacy-0"] will be created
  + resource "ionoscloud_k8s_node_pool" "nodepool_legacy" {
      + allow_replace     = false
      + availability_zone = "ZONE_1"
      + cores_count       = 4
      + cpu_family        = "INTEL_SKYLAKE"
      + datacenter_id     = "UUID"
      + id                = (known after apply)
      + k8s_cluster_id    = "UUID"
      + k8s_version       = "1.31.9"
      + labels            = {
          + "purpose" = ""
        }
      + name              = "name-zone1-nodepool-0"
      + node_count        = 2
      + public_ips        = []
      + ram_size          = 16384
      + server_type       = "DedicatedCore"
      + storage_size      = 100
      + storage_type      = "SSD"

      + lans {
          + dhcp = true
          + id   = 2
        }
      + lans {
          + dhcp = true
          + id   = 6
        }

      + maintenance_window {
          + day_of_the_week = "Friday"
          + time            = "21:00:00Z"
        }
    }

  # module.ionos_k8s_cluster[0].ionoscloud_k8s_node_pool.nodepool_legacy["ZONE_2-legacy-0"] will be created
  + resource "ionoscloud_k8s_node_pool" "nodepool_legacy" {
      + allow_replace     = false
      + availability_zone = "ZONE_2"
      + cores_count       = 4
      + cpu_family        = "INTEL_SKYLAKE"
      + datacenter_id     = "UUID"
      + id                = (known after apply)
      + k8s_cluster_id    = "UUID"
      + k8s_version       = "1.31.9"
      + labels            = {
          + "purpose" = ""
        }
      + name              = "name-zone2-nodepool-0"
      + node_count        = 2
      + public_ips        = []
      + ram_size          = 16384
      + server_type       = "DedicatedCore"
      + storage_size      = 100
      + storage_type      = "SSD"

      + lans {
          + dhcp = true
          + id   = 2
        }
      + lans {
          + dhcp = true
          + id   = 6
        }

      + maintenance_window {
          + day_of_the_week = "Friday"
          + time            = "23:00:00Z"
        }
    }

  # module.ionos_pg_cluster[0].ionoscloud_pg_cluster.pg_cluster will be updated in-place
  ~ resource "ionoscloud_pg_cluster" "pg_cluster" {
      + allow_replace        = false
        id                   = "UUID"
        # (10 unchanged attributes hidden)

      ~ connections {
          ~ cidr          = "10.x.x.x/16" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.ionos_pg_cluster[0].module.cidr_workaround.data.ionoscloud_k8s_cluster.k8s_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "ionoscloud_k8s_cluster" "k8s_cluster" {
      + api_subnet_allow_list      = (known after apply)
      + available_upgrade_versions = (known after apply)
      + ca_crt                     = (sensitive value)
      + config                     = (sensitive value)
      + id                         = "UUID"
      + k8s_version                = (known after apply)
      + kube_config                = (known after apply)
      + location                   = (known after apply)
      + maintenance_window         = (known after apply)
      + name                       = (known after apply)
      + nat_gateway_ip             = (known after apply)
      + node_pools                 = (known after apply)
      + node_subnet                = (known after apply)
      + public                     = (known after apply)
      + s3_buckets                 = (known after apply)
      + server                     = (sensitive value)
      + state                      = (known after apply)
      + user_tokens                = (sensitive value)
      + viable_node_pool_versions  = (known after apply)
    }

  # module.ionos_pg_cluster[0].module.cidr_workaround.data.ionoscloud_k8s_node_pool.k8s_node_pool will be read during apply
  # (config refers to values not yet known)
 <= data "ionoscloud_k8s_node_pool" "k8s_node_pool" {
      + annotations                = (known after apply)
      + auto_scaling               = (known after apply)
      + availability_zone          = (known after apply)
      + available_upgrade_versions = (known after apply)
      + cores_count                = (known after apply)
      + cpu_family                 = (known after apply)
      + datacenter_id              = (known after apply)
      + id                         = (known after apply)
      + k8s_cluster_id             = "UUID"
      + k8s_version                = (known after apply)
      + labels                     = (known after apply)
      + lans                       = (known after apply)
      + maintenance_window         = (known after apply)
      + name                       = (known after apply)
      + node_count                 = (known after apply)
      + public_ips                 = (known after apply)
      + ram_size                   = (known after apply)
      + server_type                = (known after apply)
      + state                      = (known after apply)
      + storage_size               = (known after apply)
      + storage_type               = (known after apply)
    }

  # module.ionos_pg_cluster[0].module.cidr_workaround.data.ionoscloud_servers.k8s_node will be read during apply
  # (config refers to values not yet known)
 <= data "ionoscloud_servers" "k8s_node" {
      + datacenter_id = (known after apply)
      + id            = (known after apply)
      + servers       = (known after apply)

      + filter {
          + name  = "name"
          + value = (known after apply)
        }
    }

  # module.ionos_pg_cluster[0].module.cidr_workaround.data.ionoscloud_servers.k8s_nodes will be read during apply
  # (config refers to values not yet known)
 <= data "ionoscloud_servers" "k8s_nodes" {
      + datacenter_id = (known after apply)
      + id            = (known after apply)
      + servers       = (known after apply)

      + filter {
          + name  = "name"
          + value = "nodepool"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```